{
    "ui": {
        "init": {
            "title": "Loading the simulation...",
            "logs": {
                "constant": [
                    "Assembling the Hello World...",
                    "Filling the coffee maker...",
                    "Compiling the coffee..."
                ],
                "random": [
                    "Searching for the missing semicolon...",
                    "Hiding the Pokédex...",
                    "Loading planets...",
                    "Transforming geoids into spheres...",
                    "Aligning the orbits...",
                    "Switching to the latest JS framework...",
                    "Convincing the AI not to become evil...",
                    "Stopping procrastination..."
                ]
            }
        },
        "galaxy": {
            "configuration": {
                "title": "Configuration",
                "description": "Adjust the settings for the galaxy view."
            }
        },
        "contact": {
            "title": "Contact",
            "mail": "E-mail",
            "phone": "Phone",
            "linkedin": "LinkedIn",
            "or": "Or",
            "sendMessage": "send a message",
            "name": "Name",
            "email": "Email",
            "message": "Message",
            "send": "Send"
        }
    },
    "starSystem": {
        "AboutMe": "About Me"
    },
    "star": {
        "Sun": {
            "title": "Solar System",
            "description": "The solar system consists of the sun and all celestial bodies that orbit around it."
        }
    },
    "planet": {
        "My": {
            "title": "About Me",
            "data": [
                {
                    "title": "About Me",
                    "paragraphs": [
                        "Hello! I'm Luis Henrique, a Full-Stack developer passionate about creating digital solutions that are both elegant and efficient. With over 5 years of experience in the market, my focus is to transform complex ideas into robust and intuitive web applications, using best development practices to ensure scalability and a flawless user experience."
                    ]
                },
                {
                    "title": "First Contact",
                    "paragraphs": [
                        "My journey in technology didn't start with lines of code, but with the characteristic sound of a dial-up modem and the screen of an old tube computer. I vividly remember the first time I had access to a PC with Windows 98; it was a box full of mysteries and endless possibilities. I spent hours exploring Paint, organizing files into folders that led nowhere, and mainly trying to understand how that machine could create entire worlds inside a monitor. It was this childlike curiosity, this desire to unravel the 'magic' behind the screen, that planted the seed of my passion and guided me to the career I have today. That initial fascination never left me; it just evolved."
                    ]
                },
                {
                    "title": "Why I Code",
                    "paragraphs": []
                }
            ]
        },
        "Projects": {
            "title": "Projects",
            "data": [
                {
                    "title": "Gatuno",
                    "technologies": [
                        "typescript",
                        "docker",
                        "angular",
                        "nestjs",
                        "mysql",
                        "selenium"
                    ],
                    "description": "A book aggregator project that collects books from various sources and makes them available to the user in a single place."
                },
                {
                    "title": "Tradutor",
                    "technologies": [
                        "python",
                        "ruby",
                        "ollama",
                        "googletranslate"
                    ],
                    "description": "A RPGMAKER game translation project that uses artificial intelligence to provide accurate and contextual translations."
                }
            ]
        },
        "Experiences": {
            "title": "Experiences",
            "data": [
                {
                    "company": "Cedro Rosa",
                    "period": "January 2022 - Present",
                    "position": "Full-Stack Developer",
                    "description": "",
                    "tasks": [
                        "Led the development of the authentication module for the main platform, resulting in a 20% improvement in security.",
                        "Collaborated in an agile team to design and implement new features, using modern technologies.",
                        "Optimized database queries, reducing API response time by an average of 300ms."
                    ]
                }
            ]
        }
    },
    "experience": {
        "period": "Period",
        "position": "Position",
        "description": "Description",
        "tasks": "Tasks"
    }
}
